
&НаСервереБезКонтекста
Процедура ОтключитьОтЦентральнойНаСервере()
	Попытка
		ПланыОбмена.УстановитьГлавныйУзел(Неопределено);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "База отключена от РИБ";
		Сообщение.Сообщить(); 
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтЦентральной(Команда)
	ОтключитьОтЦентральнойНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодключитьКЦентральнойНаСервере(ЦентральныйУзел)
	Попытка
		ПланыОбмена.УстановитьГлавныйУзел(ЦентральныйУзел);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "База подключена к РИБ";
		Сообщение.Сообщить(); 
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКЦентральной(Команда)
	Если Не ЗначениеЗаполнено(ЦентральныйУзел) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните центральный узел!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	ПодключитьКЦентральнойНаСервере(ЦентральныйУзел);
КонецПроцедуры
